app/views/sessions/new.html.erb

SELECT "users".* FROM "users"
---
     <select name="user[id]" id="user_name">
      <% User.all.each do |user| %>