app/views/flights/commercial.html.erb

SELECT "flights".* FROM "flights" WHERE (flight_sit >= 5)
---
<%@flight.big_flight.each do |f|%>