app/views/flights/index.html.erb

SELECT "flights".* FROM "flights" WHERE "flights"."inspection" = ?  [["inspection", 1]]
---

<% Flight.pass_inspection.each do |p|%>