app/views/users/show.html.erb


    <% @user.flight_rides.each do |user_flight_ride|%>
---
SELECT "flights".* FROM "flights" INNER JOIN "flight_rides" ON "flights"."id" = "flight_rides"."flight_id" WHERE "flight_rides"."user_id" = ?  [["user_id", 30]]
SELECT "flight_rides".* FROM "flight_rides" WHERE "flight_rides"."user_id" = ?  [["user_id", 27]]