app/controllers/flight_rides_controller.rb

        def index
          @flight_ride = FlightRide.new
          @flight_rides= FlightRide.all
---
SELECT "flight_rides".* FROM "flight_rides"

         def create

            @user = User.find(params[:user_id]) # finding the parent
            @flight_ride = @user.flight_rides.build(flight_ride_params)
           if @flight_ride.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
INSERT INTO "flight_rides" ("user_id", "flight_id", "flight_class", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 30], ["flight_id", 9], ["flight_class", "First_class"], ["created_at", "2018-11-30 20:14:03.720852"], ["updated_at", "2018-11-30 20:14:03.720852"]]

          def edit
               # if logged_in?
                  @flight_ride = FlightRide.find(params[:id])
---
SELECT  "flight_rides".* FROM "flight_rides" WHERE "flight_rides"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]

         def update
            @flight_ride = FlightRide.find(params[:id])
---
SELECT  "flight_rides".* FROM "flight_rides" WHERE "flight_rides"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]

         def show
            @flight_ride = FlightRide.find(params[:id])
---
SELECT  "flight_rides".* FROM "flight_rides" WHERE "flight_rides"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]

         def destroy
            @flight_ride = Flight_ride.find(params[:id])
            session[:user_id] = nil
             reset_session
            @flight_ride.delete
---
SELECT  "flight_rides".* FROM "flight_rides" WHERE "flight_rides"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
DELETE FROM "flight_rides" WHERE "flight_rides"."id" = ?  [["id", 45]]