app/controllers/flight_ride_controller.rb

INSERT INTO "flight_rides" ("user_id", "flight_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["flight_id", 12], ["created_at", "2018-11-13 14:47:05.377148"], ["updated_at", "2018-11-13 14:47:05.377148"]]
---
  def new

   @flight_ride = FlightRide.create(:user_id => params[:user_id], :flight_id => params[:flight_id])