app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
---
  def index
    @user = User.new
    @flights = Flight.all

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show

    @flight_rides = FlightRide.new
    @user = current_user
    @flight = Flight.find(params[:id])

INSERT INTO "flights" ("inspection", "fuel_cost", "destination", "flight_departure", "flight_sit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
   def create
    @flight = Flight.create(flight_params)

    if @flight.save
        @flight = Flight.create(flight_params)

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
---
    def edit
      @flight = Flight.find(params[:id])

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
  def update
    @flight = Flight.find(params[:id])

SELECT "flights"."id" FROM "flights" WHERE (flight_sit >= 5)
---
  def commercial
    @flight = Flight.all