app/controllers/flights_controller.rb

   def show

    @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

  def flight_data
    post = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]