app/controllers/sessions_controller.rb

  def create
     # normal log in
    if auth_hash = request.env["omniauth.auth"]
              @user = User.find_or_create_by_omniauth(auth_hash)
              @current_user = @user.name
              session[:user_id] = @user.id
              redirect_to user_path(@user)

    else
        @user = User.find_by(:id => params[:user][:id])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "Milo King"], ["LIMIT", 1]]