app/controllers/sessions_controller.rb

  def create

     # normal log in
          @user = User.find_by(:id => params[:user][:id])
         if @user && @user.authenticate(params[:user][:password])
            session[:user_id] = @user.id

            redirect_to user_path

          elsif

            if auth_hash = request.env["omniauth.auth"]
                @user = User.find_or_create_by(uid: auth["info"]["email"]) do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 57], ["LIMIT", 1]]