app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "john"], ["password_digest", "$2a$10$vyTz0G.Zz3Rsk0zSYi7Z5OH/tvIZfOTcWg3KU3LXqjVS0jNa51wnu"], ["created_at", "2018-11-17 17:31:46.697603"], ["updated_at", "2018-11-17 17:31:46.697603"]]
---
 def create
  @user = User.new(user_params)

  if @user.valid?
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
   def show
    if !session.include?(:user_id)
      redirect_to root_path
    else
    @user = User.find(params[:id])