app/models/user.rb

	validates :name, format: {without: /[0-9]/, message: "does not allow numbers" }
	validates :password, presence: true

#  omniauth goes here.
	def self.find_or_create_by_omniauth(auth_hash)
        self.where(:name => auth_hash[:info][:name]).first_or_create do |user|
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["uid", "2229161043763552"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "Milo King"], ["LIMIT", 1]]